load-testing/dashboard.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 0
      rampTo: 100
      name: "warm up the application"
    - duration: 120
      arrivalRate: 10
      name: "max load"
scenarios:
  - flow:
      - get:
          url: "/viade_en1b#/dashboard"
    name: "Dashboard"
  - flow:
      - get:
          url: "/viade_en1b#/routes/MyRoutes"
    name: "MyRoutes"